#include <iostream>
#include <string>
#include <cmath>
#include <algorithm>
//#define DEBUG         //убрать комментарий для показа откладки
using namespace std;
string alf="abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";
string ALFbi[52]= //алфавит в бинарном виде
{
    {"01100001"},{"01100010"},{"01100011"},{"01100100"},
    {"01100101"},{"01100110"},{"01100111"},{"01101000"},
    {"01101001"},{"01101010"},{"01101011"},{"01101100"},
    {"01101101"},{"01101110"},{"01101111"},{"01110000"},
    {"01110001"},{"01110010"},{"01110011"},{"01110100"},
    {"01110101"},{"01110110"},{"01110111"},{"01111000"},
    {"01111001"},{"01111010"},{"01000001"},{"01000010"},
    {"01000011"},{"01000100"},{"01000101"},{"01000110"},
    {"01000111"},{"01001000"},{"01001001"},{"01001010"},
    {"01001011"},{"01001100"},{"01001101"},{"01001110"},
    {"01001111"},{"01010000"},{"01010001"},{"01010010"},
    {"01010011"},{"01010100"},{"01010101"},{"01010110"},
    {"01010111"},{"01011000"},{"01011001"},{"01011010"}
};
int Sblok(int a,int b){//S блок
    int i=a,j=b;
    int SB[8][16]=
    {
        {1 ,7 ,14,13,0 ,5 ,8 ,3 ,4 ,15,10,6 ,9 ,12,11,2 },
        {8 ,14,2 ,5 ,6 ,9 ,1 ,12,15,4 ,11,0 ,13,10,3 ,7 },
        {5 ,13,15,6 ,9 ,2 ,12,10,11,7 ,8 ,1 ,4 ,3 ,14,0 },
        {7 ,15,5 ,10,8 ,1 ,6 ,13,0 ,9 ,3 ,14,11,4 ,2 ,12},
        {12,8 ,2 ,1 ,13,4 ,15,6 ,7 ,0 ,10,5 ,3 ,14,9 ,11},
        {11,3 ,5 ,8 ,2 ,15,10,13,14,1 ,7 ,4 ,12,9 ,6 ,0 },
        {6 ,8 ,2 ,3 ,9 ,10,5 ,12,1 ,14,4 ,7 ,11,13,0 ,15},
        {12,4 ,6 ,2 ,10,5 ,11,9 ,14,8 ,13,7 ,0 ,3 ,15,1 }
    };
    return SB[i][j];
};
string KEYbi[8]= //массв из 8 ключей
{
    {"11100001111011101110101111101110"},
    {"11101101111010001110110111101100"},
    {"11101000111101011110000011101000"},
    {"11101011111000001110101111100101"},
    {"11101010111100011110000011101101"},
    {"11100100111100001110111011100010"},
    {"11101000111101111110000111101110"},
    {"11101011111011101110110100001010"}
};
unsigned long int TEN(string a){
    unsigned long int x=0;
    int size=a.length()-1;
    for(int i=size;i>=0;i--){ if(a[i]=='1'){ x+=pow(2,(size-i));}}
    return x;
}
string BIN(unsigned long int x){ //функция перевода числа в двоичный код
    string a,b;
    if(x>16){
        while(x!=0){
            if(x%2==0){ b+="0";}
            else{ b+="1";}
            x/=2;
        }
        reverse(b.begin(), b.end());
        while(b.length()%8!=0){ b='0'+b;}
    }
    else{ if(x==0){ b="0000";}
    else{
        while(x!=0){
            if(x%2==0){ b+="0";}
            else{ b+="1";}
            x/=2;
        }
        while(b.length()!=4){ b+='0';}
        reverse(b.begin(), b.end());
    }
    }
    return b;
}
string BIN11(string x){ //функция смещения на 11
    string a,b;
    for(int i=0;i<11;i++){ a+=x[i];}
    for(int i=11;i<32;i++){ b+=x[i];}
    x=b+a;
    return x;
};
void Kryptex(int f);
//======================================
int main()
{
    setlocale(LC_ALL,"ru");
    int m=0;
    cout<<"ЗАКОДИРОВАТЬ  (1)"<<endl;
    cout<<"РАСКОДИРОВАТЬ (2)"<<endl;
    while(true){
        cout<<">";
        cin>>m;
        if(m==1||m==2){ break;}
    }
    Kryptex(m);
}
//======================================
void Kryptex(int f){ //объединенная функция шифрование/расшифрования
    unsigned long int Rten=0,Lten=0,KEYten=0,POW232=4294967296,FIVEten=0;
    int r1=0,r2=0,r3=0,r4=0,r5=0,r6=0,r7=0,r8=0,t=0,l=0,a=0,I=0,k=0;
    string messege,R,L,Rbi,Lbi,FIVEbi,RBI,LBI,m1,m2,m3,m4,m5,m6,m7,m8;;
    if(f==1){
        while(true){
            cout<<"ВВЕДИТЕ СООБЩЕНИЕ ИЗ 8 СИМВОЛОВ: ";
            cin>>messege;
            if(messege.length()==8){ break;}
        }
        for(int i=0;i<4;i++){ L+=messege[i];} //образование левой части исходного 8 символьного сообщения
        for(int i=4;i<8;i++){ R+=messege[i];} //образование правой части исходного 8 символьного сообщения
        for(int i=4;i<8;i++){
            for(int j=0;j<52;j++){
                if(messege[i]==alf[j]){ Rbi+=ALFbi[j];} //перевод правой части в бинарный код
            }
        }
        for(int i=0;i<4;i++){
            for(int j=0;j<52;j++){
                if(messege[i]==alf[j]){ Lbi+=ALFbi[j];} //перевод левой части в бинарный код
            }
        }
        cout<<"\nИСХОДНЫЕ ДАННЫЕ:"<<endl;
        cout<<"Сообщение: "<<messege<<"("<<Lbi+Rbi<<")"<<endl;
        cout<<"Левая часть:   "<<L<<"("<<Lbi<<")"<<endl;
        cout<<"Правая часть:  "<<R<<"("<<Rbi<<")"<<endl;
    }
    else{
        while(true){
            cout<<"ВВЕДИТЕ БИНАРНЫЙ КОД ИЗ 64 СИМВОЛОВ: ";
            cin>>messege;
            if(messege.length()==64){ break;}
        }
        for(int i=0;i<32;i++){ Lbi+=messege[i];} //образование левой части исходного 64 символьного сообщения
        for(int i=32;i<64;i++){ Rbi+=messege[i];} //образование правой части исходного 64 символьного сообщения
        cout<<"\nИСХОДНЫЕ ДАННЫЕ:"<<endl;
        cout<<"Левая часть:   "<<"("<<Lbi<<")"<<endl;
        cout<<"Правая часть:  "<<"("<<Rbi<<")"<<endl;
    }
#ifdef DEBUG
    cout<<"FIVE - временный преобразования правой части"<<endl<<endl;
#endif
    for(int i=0;i<32;i++){
        r1=0,r2=0,r3=0,r4=0,r5=0,r6=0,r7=0,r8=0;
        KEYten=0;
        if(f==1){ I=i%8;}
        else{ I=7-i%8;}
#ifdef DEBUG
        cout<<"======================================================================================================="<<endl;
        cout<<i<<")начало   Lbi)"<<Lbi<<"  "<<"Rbi)"<<Rbi<<endl<<endl;
#endif
        if(f==1){ //алгоритм выбора ключей
            if(i<24){ a=i%8;}
            else{ a=7-(i%8);}
        }
        else{
            if(i<8){ a=i%8;}
            else{ a=7-(i%8);}
            LBI=Lbi;
            RBI=Rbi;
            Rbi=Lbi;
        }
#ifdef DEBUG
        cout<<"КЛЮЧ["<<a<<"]\t"<<KEYbi[a]<<endl;
#endif
        KEYten=TEN(KEYbi[a]); //перевод ключа из двоичного кода в десятичную систему
        Rten=TEN(Rbi); //перевод правой части из двоичного кода в десятичную систему
        FIVEten=((KEYten+Rten)%POW232)-1; //сложение правой части и ключа по модулю 2^32(дальше результат сожения)
#ifdef DEBUG
        cout<<"FIVEten(до S блока)     "<<FIVEten<<endl;
#endif
        FIVEbi=BIN(FIVEten); //перевод результата сложения в двоичный код
        for(int z=0;z<32;z++) //разбивание результата сложения на 8 чисел
        {
            t=3-z%4;
            if(FIVEbi[z]=='1'){ k=1;}
            else{ k=0;}
            if((z>=0)&&(z<4)){ r1+=k*pow(2,t);}
            if((z>=4)&&(z<8)){ r2+=k*pow(2,t);}
            if((z>=8)&&(z<12)){ r3+=k*pow(2,t);}
            if((z>=12)&&(z<16)){ r4+=k*pow(2,t);}
            if((z>=16)&&(z<20)){ r5+=k*pow(2,t);}
            if((z>=20)&&(z<24)){ r6+=k*pow(2,t);}
            if((z>=24)&&(z<28)){ r7+=k*pow(2,t);}
            if((z>=28)&&(z<32)){r8+=k*pow(2,t);}
        }
#ifdef DEBUG
        cout<<"FIVEbi(до S блока)      "<<FIVEbi<<endl;
        cout<<"                        "<<BIN(r1)<<" "<<BIN(r2)<<" "<<BIN(r3)<<" "<<BIN(r4)<<" "<<BIN(r5)<<" "<<BIN(r6)<<" "<<BIN(r7)<<" "<<BIN(r8)<<endl;
        cout<<"                        r1)"<<r1<<" r2)"<<r2<<" r3)"<<r3<<" r4)"<<r4<<" r5)"<<r5<<" r6)"<<r6<<" r7)"<<r7<<" r8)"<<r8<<endl;
#endif
        r1=Sblok(I, r1); //преобразование каждого числа через S блок
        r2=Sblok(I, r2);
        r3=Sblok(I, r3);
        r4=Sblok(I, r4);
        r5=Sblok(I, r5);
        r6=Sblok(I, r6);
        r7=Sblok(I, r7);
        r8=Sblok(I, r8);
        FIVEbi=BIN(r1)+BIN(r2)+BIN(r3)+BIN(r4)+BIN(r5)+BIN(r6)+BIN(r7)+BIN(r8); //новое значение результата сложения
#ifdef DEBUG
        cout<<"FIVEbi(после S блока)\t"<<FIVEbi<<endl;
        cout<<"                        "<<BIN(r1)<<" "<<BIN(r2)<<" "<<BIN(r3)<<" "<<BIN(r4)<<" "<<BIN(r5)<<" "<<BIN(r6)<<" "<<BIN(r7)<<" "<<BIN(r8)<<endl;
        cout<<"                        r1)"<<r1<<" r2)"<<r2<<" r3)"<<r3<<" r4)"<<r4<<" r5)"<<r5<<" r6)"<<r6<<" r7)"<<r7<<" r8)"<<r8<<endl;
#endif
        FIVEbi=BIN11(FIVEbi); //сдвиг результата сложения на 11 символов
#ifdef DEBUG
        cout<<"FIVEbi(<<<11)           "<<FIVEbi<<endl;
#endif
        FIVEten=TEN(FIVEbi); //перевод нового значения результата сложения в десятичную сиситему
        Lten=TEN(Lbi); //перевод левой части в десятичную систему
        if(f==1){
            RBI=Rbi;
            Rbi="";
        }
        else{ Lbi="";}
        for(int c=0;c<32;c++){ //побитовое сложение левой части и результата сложения
            if(f==1){
                if(Lbi[c]==FIVEbi[c]){ Rbi+='0';}
                else{ Rbi+='1';}
            }
            else{
                if(RBI[c]==FIVEbi[c]){ Lbi+='0';}
                else{ Lbi+='1';}
            }
        }
        if(f==1){ Lbi=RBI;}
#ifdef DEBUG
        cout<<endl;
        cout<<i<<")конец    Lbi)"<<Lbi<<"  "<<"Rbi)"<<Rbi<<endl;
#endif
    }
    if(f==1){
        messege=Lbi+Rbi; //образование зашифрованного сообщения
        cout<<"======================================================================================================="<<endl;
        cout<<"ДВОИЧНЫЙ КОД ЗАШИФРОВАННОГО СООБЩЕНИЯ: "<<messege<<endl;
        cout<<"======================================================================================================="<<endl;
    }
    else{
        for(int i=0;i<32;i++){ //образование 8 чисел в двоичном коде
            if((i>=0)&&(i<8)){
                m1+=Lbi[i];
                m5+=Rbi[i];
            }
            if((i>=8)&&(i<16)){
                m2+=Lbi[i];
                m6+=Rbi[i];
            }
            if((i>=16)&&(i<24)){
                m3+=Lbi[i];
                m7+=Rbi[i];
            }
            if((i>=24)&&(i<32)){
                m4+=Lbi[i];
                m8+=Rbi[i];
            }
        }
        for(int i=0;i<52;i++){ //перевод двоичного кода в буквенное значение
            if(m1==ALFbi[i]){ m1=alf[i];}
            if(m2==ALFbi[i]){ m2=alf[i];}
            if(m3==ALFbi[i]){ m3=alf[i];}
            if(m4==ALFbi[i]){ m4=alf[i];}
            if(m5==ALFbi[i]){ m5=alf[i];}
            if(m6==ALFbi[i]){ m6=alf[i];}
            if(m7==ALFbi[i]){ m7=alf[i];}
            if(m8==ALFbi[i]){ m8=alf[i];}
        }
        messege=m1+m2+m3+m4+m5+m6+m7+m8; //образование расшифрованного сообщения
        cout<<"======================================================================================================="<<endl;
        cout<<"РАСШИФРОВАННОЕ СООБЩЕНИЕ: "<<messege<<endl;
        cout<<"======================================================================================================="<<endl;
    }
    
}


